<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"6778875c8b2719531772ff23129c6bd9add1b559124d4ed457474f26cbdbca57","plan_job_ref":"Job .github/workflows/_test-tf.yaml #187 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11262174205","plan_out_hash":"ac92a6edf0539998eb838b84c3b4530687c9d932409ff02b1509bec23e4b1140","plan_hash":"913a2706752d5f05893efe606caf47d6431e9ecd6423f51807dd743db00aae0d","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #187](https://github.com/tx-pts-dai/github-workflows/actions/runs/11262174205)